(function(){
	miData = {
		
		starGoods : {
			borderColor : ['#ffcccc','#33ff00','#0033ff','#cc0033','#ffff00','#ccff00','#ff0000','#66ff00','#ff99ff','#0000ff'],
			imgSrc : ['img/starGoods/1.jpg','img/starGoods/2.jpg','img/starGoods/3.jpg','img/starGoods/4.jpg','img/starGoods/5.jpg','img/starGoods/6.jpg','img/starGoods/7.jpg','img/starGoods/8.jpg','img/starGoods/9.jpg','img/starGoods/10.jpg'],
			imgAlt : [],
			title : ['小米手机4c' , '小米手机4' , '小米Note 女神版', '小米盒子3 增强版' , '小米空气净化器2','小米路由器 mini','小米手环 光感版' ,'小米蓝牙手柄' ,'小米电视主机' ,'全新小米路由器'],
			detail : ['骁龙808旗舰手机，爱不释手' , '工艺和手感超乎想象' , '5.7英寸大屏，独立HiFi' , '4K 网络机顶盒，每天早10点现货' , '净化能力高达310m³/h' , '主流双频AC智能路由器','光感版实时监测心率，科学运动','小米电视、盒子游戏必备','次世代智能电视主机，内置独立音响','高配版路由器，企业级性能'],
			price : ['1099元起' , '1299元起' ,'1499元起' ,'399元','699元','129元','99元','99元','999元','699元']
		},

		match:{
			hot:{
				title : ['小米插线板' , '小米移动电源10000mAh','小米移动电源10000mAh 高配版' ,'小米蓝牙耳机','小米活塞耳机 标配版','小米蓝牙音箱','小米铁圈耳机','小钢炮蓝牙音箱'],
				price : ['79元','69元','499元','29元','69.9元','129元','69元','118元'],
				comment : ['19.1万','15.2万','19.1万','15.2万','6666','5000','5万','1万']
			},
			earphone:{
				title : ['小米插线板' , '小米移动电源10000mAh','小米移动电源10000mAh 高配版' ,'小米蓝牙耳机','小米活塞耳机 标配版','小米蓝牙音箱','小米铁圈耳机','小钢炮蓝牙音箱'],
				price : ['79元','69元','499元','29元','69.9元','129元','69元','118元'],
				comment : ['19.1万','15.2万','19.1万','15.2万','6666','5000','5万','1万']
			},
			card:{
				title : ['小米插线板' , '小米移动电源10000mAh','小米移动电源10000mAh 高配版' ,'小米蓝牙耳机','小米活塞耳机 标配版','小米蓝牙音箱','小米铁圈耳机','小钢炮蓝牙音箱'],
				price : ['79元','69元','499元','29元','69.9元','129元','69元','118元'],
				comment : ['19.1万','15.2万','19.1万','15.2万','6666','5000','5万','1万']
			},
			power:{
				title : ['小米插线板' , '小米移动电源10000mAh','小米移动电源10000mAh 高配版' ,'小米蓝牙耳机','小米活塞耳机 标配版','小米蓝牙音箱','小米铁圈耳机','小钢炮蓝牙音箱'],
				price : ['79元','69元','499元','29元','69.9元','129元','69元','118元'],
				comment : ['19.1万','15.2万','19.1万','15.2万','6666','5000','5万','1万']
			},
			length : 4,
			attr : ['hot' , 'earphone' , 'card' , 'power']
		}


		
	};
	window.miDate = miData;
})();